In [1]:
import pandas as pd

In [7]:
data={
    'empid':[1,2,3,4,5],
    'name':['sh','re','ya','di','xit'],
    'age':[10,11,12,12,13],
    'pic':['p1','p2','p3','p4','p5']
}

df=pd.DataFrame(data)
d=df.to_csv("new.csv",index=False)
print("data is entered")

data is entered

READ DATA

In [8]:
d=pd.read_csv("new.csv")
d

   empid name  age pic
0      1   sh   10  p1
1      2   re   11  p2
2      3   ya   12  p3
3      4   di   12  p4
4      5  xit   13  p5

In [10]:
d=pd.read_csv("new.csv",nrows=2)
d

   empid name  age pic
0      1   sh   10  p1
1      2   re   11  p2

In [11]:
d=pd.read_csv("new.csv",nrows=2,usecols=["name","age"])
d

  name  age
0   sh   10
1   re   11

In [14]:
p=pd.read_csv("new.csv",nrows=2,usecols=[3,2])
p

   age pic
0   10  p1
1   11  p2

In [16]:
d=pd.read_csv("new.csv",skiprows=[0])
d

   1   sh  10  p1
0  2   re  11  p2
1  3   ya  12  p3
2  4   di  12  p4
3  5  xit  13  p5

In [17]:
d=pd.read_csv("new.csv",names=[11,12,13,14])
d

      11    12   13   14
0  empid  name  age  pic
1      1    sh   10   p1
2      2    re   11   p2
3      3    ya   12   p3
4      4    di   12   p4
5      5   xit   13   p5

In [18]:
d=pd.read_csv("new.csv",header=2)
d

   2   re  11  p2
0  3   ya  12  p3
1  4   di  12  p4
2  5  xit  13  p5

In [19]:
d=pd.read_csv("new.csv",index_col=["age"])
d

     empid name pic
age
10       1   sh  p1
11       2   re  p2
12       3   ya  p3
12       4   di  p4
13       5  xit  p5

In [21]:
d=pd.read_csv("new.csv")
d.index

RangeIndex(start=0, stop=5, step=1)

In [22]:
d=pd.read_csv("new.csv")
d.columns

Index(['empid', 'name', 'age', 'pic'], dtype='object')

In [23]:
d=pd.read_csv("new.csv")
df.describe()

          empid        age
count  5.000000   5.000000
mean   3.000000  11.600000
std    1.581139   1.140175
min    1.000000  10.000000
25%    2.000000  11.000000
50%    3.000000  12.000000
75%    4.000000  12.000000
max    5.000000  13.000000

In [24]:
d=pd.read_csv("new.csv")
d.head(3)#return the start 5 rows by strting by default

   empid name  age pic
0      1   sh   10  p1
1      2   re   11  p2
2      3   ya   12  p3

In [25]:
d=pd.read_csv("new.csv")
d.tail(3)

   empid name  age pic
2      3   ya   12  p3
3      4   di   12  p4
4      5  xit   13  p5

In [26]:
d=pd.read_csv("new.csv")
d[2:4]

   empid name  age pic
2      3   ya   12  p3
3      4   di   12  p4

In [31]:
d=pd.read_csv("new.csv")
#d.info()
df.info(verbose=False)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Columns: 4 entries, empid to pic
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes

In [32]:
d=pd.read_csv("new.csv")
d.count()

empid    5
name     5
age      5
pic      5
dtype: int64

In [26]:
import pandas as pd

# Create a DataFrame from the provided data
data = {
    'empid': [1, 1, 3, 4, 5],
    'name': ['sh', 'sh', 'ya', 'di', 'xit'],
    'age': [10, 10, 12, 12, 13],
    'pic': ['p1', 'p1', 'p3', 'p4', 'p5'],
    'piic': ['p1', 'p1', 'p2', 'p4', 'p5'],
    'na': ["", "", "", "", ""]
}

df = pd.DataFrame(data)

# Save the DataFrame to a CSV file
df.to_csv("uni.csv", index=False)

# Read the CSV file into a new DataFrame
d = pd.read_csv("uni.csv")

# Remove duplicate rows
d=d.drop_duplicates()
d = d.dropna(axis=1)

d

pd.read_csv("uni.csv")

   empid name  age pic piic  na
0      1   sh   10  p1   p1 NaN
1      1   sh   10  p1   p1 NaN
2      3   ya   12  p3   p2 NaN
3      4   di   12  p4   p4 NaN
4      5  xit   13  p5   p5 NaN